"""
листтовете са променливи changeable (mutable), което означава, че
във тях можем да вадим и прибавяме елементи, както и да разместваме
местата им....
"""
nums = [1, 2, 3]
print(nums)  # принтира листа
nums[2] = 100 # заменя стойността на елемента от листа на индекс 2
print(nums)
nums[0], nums[2] = nums[2], nums[0]  # сменя местата на елементите на индекс 0 индекс 2
print(nums)                          # !!!този метод работи само когато са на един ред!!!

words = ["abc", "deff"]
concatenate_lists = nums + words # Конкатениране, събиране нс листове...
print(words + nums)
print(concatenate_lists)

a = "a b b c f g" # as a str: str --> .split --> list_of_the_day
b = a.split()  # split се използва за преобразуване от str --> list_of_the_day
               # не мофе да се изполва за числови данни...

print(b[0])       # връща стойността от листа на индекс 1 и пр....
print(b[3])       # връща стойността от листа на индекс 1 и пр....
print(b[-1])      # ще принтира последния елемент от списъкс
print(b, type(b)) # в пайтън листът може да се разглежда от дясно на ляво и обратно
                  # по индекси в сличая -1 ни връща елемента който е на последния икдекс
                  # важно е да се инимава независимо как достъпваме елементите да не излезем от обхвата..

rev_to_str = "|".join(b)  # join не работи с колекция от числа а само със str
print(rev_to_str, type(rev_to_str)) # използва се за преобразуване от list_of_the_day --> str, като
                          # като мойе да се окайе със какъв сепаратор да са разделени
                          # елементите на стринга, ако кавичките са празни долепя елементите


for element in b:
    print(element, end="." )  # обхожда по ЕЛЕМЕНТИ листа и ги отпечатва
print()

for index in range(len(b)):   # обхожда листа по ИНДЕКСИ като връща елемента от съответния индекс
    print(b[index], end=" ")  # можем да да обхождаме и част от листа -->
print()                       # for index in range(2, len(b), 1): пр.....

for ind_2 in range(len(b) - 1, -1, -1):  # това нещо не го схващам... да видя как може да се върти на обратно,
    print(b[ind_2], end=" ")             # работииии и печата на обратно.... да си припомня фор циклите...

print("\n___List Manipulations___")
"""
 Каква е разликата между метод и функция при 
 работата с листове и по принцип. Когато имаме .append .pop и пр.
 това са методи....
"""
list = ["aa", "bb", "cc"]
list.append("AA")  # С .append се вмъкват елементи в листа - разширява листа
list.append("BB")  # ако листът е празен те се подреждат по реда на добавянеро
list.append("CC")  # ако листът има вече някакви елементи, новите елементи се
print(list)        # добавят на края на листа, отново в реда на вмъкването
                   # работи със str, int, num, list_of_the_day и пр..

list.remove("bb")  # премахва конкретен елемент т.е. трябва да посочим кое да се махне от листа
list.remove("BB")  # ако кажем да се махне елемент който го няма в листа ще върне грешка
print(list)        # не може да използваме празен .remove()
                   # remove премахва само първия решнат елемент, ако имаме няколко еднакви елемента в листа
                   # ще премахне само първия, за да премахнем всички --> for + if проверка
                   # ПРЕМАХВА ПО ЕЛЕМЕНТ

list_1 = ["aa", "cc"]                 # Вмъква, добавя елемент на конкретен индекс в листа
list_1.insert(1,"bb")  # първия аргумент е индекса на който се дожавя, а втрия е елемента
print(list_1)                         # като измества всички други елементи с едно на дясно

list_1.pop(0)  # .pop премахва елемент ПО ИНДЕКС
print(list_1)  # можем да оставим скобите на поп празни,
print(list_1.pop())  # тогававинги ще махне последния елемент и ще го върне
                     # за разлика от реможе pop връща стойност...

print("___Looping Trought Lists___")

test_list = ["cat", "dog", "monkey"] # pop не работи добре със for да си пиграя..
while len(test_list) > 0:
    print(test_list[0], end=" ")
    test_list.pop(0)

print("\n___Searching for Elements in list___")
"""

"""
test_list1 = ["cat", "dog", "monkey", "monkey"]

for ele in test_list1:
    if ele == "monkey":
        print("banana")

if "monkey" in test_list1:
    print("banana, banana")

if "lion" not in test_list1:
    print("sorry")
else:
    print("There are other anymals...")